// Source code adopted from electronix.ru
// --------------------------------------

#include "cpu/avr/drivers/display/mt12864/driver.h"

#include <stdint.h>
#include <avr/io.h>
#include <compat/deprecated.h>
#include <util/delay.h>
#include <avr/pgmspace.h>


#define SMALL_DELAY (F_CPU/1000000)
#define LARGE_DELAY (F_CPU/100000)


/*--------------------------------------------------------------------------------------------*/
/* Процедура ожидания готовности контроллера ЖКИ.                                             */
/* Принимает:   контроллер (0, 1).                                                            */
/* Возвращает:  true, если контроллер готов, false иначе.                                     */
/*--------------------------------------------------------------------------------------------*/
uint8_t Wait_LCD_Ready(uint8_t c)
{
  register uint8_t i = 0;
  // Переведем шину данных на ввод и выставим все управляющие сигналы.
  LCD_Data_Bus_To_Input();
  mt12864_set_line_RW;
  mt12864_clear_line_E;
  mt12864_clear_line_A0;
  mt12864_clear_cs(c);
  // Сформируем строб и считаем с шины данных состояние контроллера.
  for(i = 0; i < 10; i++)
     {
       _delay_loop_1(SMALL_DELAY);
       mt12864_set_line_E;
       _delay_loop_1(SMALL_DELAY);
       register uint8_t state = Get_Data_from_LCD_Data_Bus();
       mt12864_clear_line_E;
       if((state & _BV(7)) == 0) break;
     }
  // Снимем выборки с ЖКИ.
  mt12864_set_cs;
  return i < 10;
}

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи команды в контроллеры ЖКИ.                                                */
/* Принимает:   контроллер (0, 1), код записываемой команды.                                  */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Cmd_to_LCD(uint8_t c, uint8_t cmd)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на вывод и выставим все управляющие сигналы.
  LCD_Data_Bus_to_Output();
  mt12864_clear_line_E;
  mt12864_clear_line_A0;
  mt12864_clear_line_RW;
  mt12864_clear_cs (c);

  // Выставим на шину данных код команды и сопроводим его стробом.
  Put_Data_to_LCD_Data_Bus(cmd);
  mt12864_set_line_E;
  _delay_loop_1(SMALL_DELAY);
  mt12864_clear_line_E;
  // Снимем выборки с ЖКИ.
  mt12864_set_cs;
}



/*--------------------------------------------------------------------------------------------*/
/* Процедура записи 1 байта данных в контроллер ЖКИ.                                          */
/* Принимает:   контроллер (0, 1), записываемый байт данных.                                  */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Data_to_LCD(uint8_t c, uint8_t data)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на вывод и выставим все управляющие сигналы.
  LCD_Data_Bus_to_Output();
  mt12864_set_line_A0;
  mt12864_clear_line_E;
  mt12864_clear_line_RW;
  mt12864_clear_cs(c);
  // Выставим на шину данных байт данных и сопроводим его стробом.
  Put_Data_to_LCD_Data_Bus(data);
  mt12864_set_line_E;
  _delay_loop_1(SMALL_DELAY);
  mt12864_clear_line_E;
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
}

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n байтов данных в контроллер ЖКИ.                                         */
/* Принимает:   контроллер (0, 1), адрес массива выводимых байтов, число выводимых байтов.    */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/

void Write_Data_to_LCD_prog(uint8_t c, prog_uint8_t* pData, uint8_t n)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на вывод и выставим все управляющие сигналы.
  LCD_Data_Bus_to_Output();
  mt12864_set_line_A0;
  mt12864_clear_line_E;
  mt12864_clear_line_RW;
  mt12864_clear_cs(c);
  // В цикле выcтавляем на шину данных байты и сопровождаем их стробами.
  for(register uint8_t i = 0; i < n; i++)
     {
       Put_Data_to_LCD_Data_Bus(*(pData + i));
       mt12864_set_line_E;
       _delay_loop_1(SMALL_DELAY);
       mt12864_clear_line_E;
       _delay_loop_1(LARGE_DELAY);
     }
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
}


/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n байтов данных в контроллер ЖКИ.                                         */
/* Принимает:   контроллер (0, 1), адрес массива выводимых байтов, число выводимых байтов.    */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
/*
void Write_Data_to_LCD(uint8_t c, uint8_t* pData, uint8_t n)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на вывод и выставим все управляющие сигналы.
  LCD_Data_Bus_to_Output();
  mt12864_set_line_A0;
  mt12864_clear_line_E;
  mt12864_clear_line_RW;
  mt12864_clear_cs(c);
  // В цикле выcтавляем на шину данных байты и сопровождаем их стробами.
  for(register uint8_t i = 0; i < n; i++)
     {
       Put_Data_to_LCD_Data_Bus(*(pData + i));
       mt12864_set_line_E;
       _delay_loop_1(SMALL_DELAY);
       mt12864_clear_line_E;
       _delay_loop_1(LARGE_DELAY);
     }
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
}
*/

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n копий байта данных в контроллер ЖКИ.                                    */
/* Принимает:   контроллер (0, 1), выводимый байт, число его повторений.                      */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Data_to_LCD_n(uint8_t c, uint8_t data, uint8_t n)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на вывод и выставим все управляющие сигналы.
  LCD_Data_Bus_to_Output();
  mt12864_set_line_A0;
  mt12864_clear_line_E;
  mt12864_clear_line_RW;
  mt12864_clear_cs(c);
  // В цикле выcтавляем на шину данных байт данных и сопровождаем его стробом.
  for(register uint8_t i = 0; i < n; i++)
     {
       Put_Data_to_LCD_Data_Bus(data);
       mt12864_set_line_E;
       _delay_loop_1(SMALL_DELAY);
       mt12864_clear_line_E;
       _delay_loop_1(LARGE_DELAY);
     }
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
  return;
}



/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n байтов данных в столбцы ЖКИ.                                            */
/* Принимает:   координаты начала записи (страница/столбец),                                  */
/*              адрес массива с записываемыми байтами, число записываемых байтов.             */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Data_to_LCD_4(uint8_t P, uint8_t C, uint8_t *pData, uint8_t n)
{
  uint8_t x = C, i = 0;
  while(x < (C + n))
    {
      if(x < 64)
        {
          Write_Cmd_Page_Addr_Set(0, P);
          Write_Cmd_Column_Addr_Set(0, x);
          i = 64 - x;
          Write_Data_to_LCD_prog(0, pData, i);
        }
      else
        {
          Write_Cmd_Page_Addr_Set(1, P);
          Write_Cmd_Column_Addr_Set(1, x - 64);
          i = (C + n) - x;
          Write_Data_to_LCD_prog(1, pData, i);
        }
      x += i;
      pData += i;
    }
}



/*--------------------------------------------------------------------------------------------*/
/* Процедура очистки ЖКИ.                                                                     */
/* Принимает:   ничего не принимает.                                                          */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void LCD_Clear(void)
{
  for(char page = 0; page < 8; page++)
     {
       // Установим страницу.
       Write_Cmd_Page_Addr_Set(0, page);
       Write_Cmd_Page_Addr_Set(1, page);
       // Очистим все столбцы страницы.
       Write_Cmd_Column_Addr_Set(0, 0);
       Write_Cmd_Column_Addr_Set(1, 0);
       Write_Data_to_LCD_n(0, (uint8_t)0x00, 64);
       Write_Data_to_LCD_n(1, (uint8_t)0x00, 64);
     }
  return;
}


/*--------------------------------------------------------------------------------------------*/
/* Процедура инициализации дисплея.                                                           */
/* Принимает:   ничего не принимает.                                                          */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void mt12864_init(void)
{
  // Переводим в исходное состояние линии управления ЖКИ:
  // все выходы в нулевом состоянии, только CS1 и CS2 = "1".
  mt12864_configure_ports();
  mt12864_clear_all_control_lines();
  mt12864_set_cs;

  // Выполняем аппаратный сброс модуля. Паузы формируем программно, так как
  // прерывания еще могут быть не разрешены.
  mt12864_clear_line_RES;
  _delay_loop_2(1000);
  mt12864_set_line_RES;
  _delay_loop_2(1000);

  // Очищаем и включаем дисплей.
  LCD_Clear();
  Write_Cmd_Display_ON();
  // Включаем подсветку, если это разрешено.
//  LCD_BackLight_ON_Cntr = 0;
//  Start_Timer(LCD_BACKLIGHT_TIMER, 1, &LCD_BackLight_Timer_Proc, TIMER_CYCLE);
}


/*--------------------------------------------------------------------------------------------*/
/* Процедура чтения 1 байта данных из контроллера ЖКИ.                                        */
/* Принимает:   контроллер (0, 1).                                                            */
/* Возвращает:  считанный байт.                                                               */
/*--------------------------------------------------------------------------------------------*/
uint8_t Read_Data_from_LCD_1(uint8_t c)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на ввод и выставим все управляющие сигналы.
  LCD_Data_Bus_To_Input();
  mt12864_set_line_A0;
  mt12864_set_line_RW;
  mt12864_clear_line_E;
  mt12864_clear_cs(c);
  // Первое чтение - dummy.
  mt12864_set_line_E;
  _delay_loop_1(SMALL_DELAY);
  mt12864_clear_line_E;
  _delay_loop_1(LARGE_DELAY);
  // Сформируем строб и считаем с шины данных байт.
  mt12864_set_line_E;
  _delay_loop_1(SMALL_DELAY);
  register uint8_t data = Get_Data_from_LCD_Data_Bus();
  mt12864_clear_line_E;
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
  return data;
}

/*--------------------------------------------------------------------------------------------*/
/* Процедура чтения n байтов данных из контроллера ЖКИ.                                       */
/* Принимает:   контроллер (0, 1), адрес массива для считанных байтов, число счит. байтов.    */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Read_Data_from_LCD(uint8_t c, uint8_t *pData, uint8_t n)
{
  // Дождемся готовности контроллера ЖКИ.
  Wait_LCD_Ready(c);
  // Переведем шину данных на ввод и выставим все управляющие сигналы.
  LCD_Data_Bus_To_Input();
  mt12864_set_line_A0;
  mt12864_set_line_RW;
  mt12864_clear_line_E;
  mt12864_clear_cs(c);
  // Первое чтение - dummy.
  mt12864_set_line_E;
  _delay_loop_1(SMALL_DELAY);
  mt12864_clear_line_E;
  // В цикле формируем стробы и считаем с шины данных байты.
  for(register uint8_t i = 0; i < n; i++)
     {
       _delay_loop_1(LARGE_DELAY);
       mt12864_set_line_E;
       _delay_loop_1(SMALL_DELAY);
       *(pData + i) = Get_Data_from_LCD_Data_Bus();
       mt12864_clear_line_E;
     }
  // Снимем выборку с ЖКИ.
  mt12864_set_cs;
  return;
}

/*--------------------------------------------------------------------------------------------*/
/* Процедура чтения содержимого n столбцов ЖКИ.                                               */
/* Принимает:   координаты начала чтения (страница/столбец),                                  */
/*              адрес массива для считанных байтов, число считываемых байтов.                 */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Read_Data_from_LCD_4(uint8_t P, uint8_t C, uint8_t *pData, uint8_t n)
{
  register uint8_t c = C, i = 0;
  while(c < (C + n))
    {
      if(c < 64)
        {
          Write_Cmd_Page_Addr_Set(0, P);
          Write_Cmd_Column_Addr_Set(0, c);
          i = 64 - c;
          Read_Data_from_LCD(0, pData, i);
        }
      else
        {
          Write_Cmd_Page_Addr_Set(1, P);
          Write_Cmd_Column_Addr_Set(1, c - 64);
          i = (C + n) - c;
          Read_Data_from_LCD(1, pData, i);
        }
      c += i;
      pData += i;
    }
  return;
}
