// Source code adopted from electronix.ru
// --------------------------------------

#ifndef __CPU__AVR__DRIVERS__DISPLAY__MT12864__DRIVER_H
#define __CPU__AVR__DRIVERS__DISPLAY__MT12864__DRIVER_H

#include "device.h"
#include <avr/pgmspace.h>


#define MT12864_CMD_DISPLAY_OFF                  (0x3E)
#define MT12864_CMD_DISPLAY_ON                   (0x3F)
#define MT12864_CMD_SET_DISPLAY_START_LINE(line) ((uint8_t)(0xC0 + ((uint8_t)line)))
#define MT12864_CMD_SET_PAGE(page)               ((uint8_t)(0xB8 + ((uint8_t)page)))
#define MT12864_CMD_SET_ADDRESS(column)          ((uint8_t)(0x40 + ((uint8_t)column)))

/*--------------------------------------------------------------------------------------------*/
/* Процедура инициализации дисплея.                                                           */
/* Принимает:   ничего не принимает.                                                          */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void mt12864_init(void);

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи команды в контроллеры ЖКИ.                                                */
/* Принимает:   контроллер (0, 1), код записываемой команды.                                  */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Cmd_to_LCD(uint8_t c, uint8_t cmd);

/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда посылки в ЖКИ команды установки адреса страницы (Page_Addr_Set).              */
/* Принимает:   контроллер (0, 1), номер страницы (0..7).                                     */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
#define   Write_Cmd_Page_Addr_Set(c, page)  Write_Cmd_to_LCD(c, MT12864_CMD_SET_PAGE(page))

/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда посылки в ЖКИ команды установки адреса столбца (Column_Addr_Set).             */
/* Принимает:   контроллер (0, 1), номер столбца (0..63).                                     */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
#define   Write_Cmd_Column_Addr_Set(c, col)    Write_Cmd_to_LCD(c, MT12864_CMD_SET_ADDRESS(col));

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n копий байта данных в контроллер ЖКИ.                                    */
/* Принимает:   контроллер (0, 1), выводимый байт, число его повторений.                      */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Data_to_LCD_n(uint8_t c, uint8_t data, uint8_t n);

/*--------------------------------------------------------------------------------------------*/
/* Процедура чтения содержимого n столбцов ЖКИ.                                               */
/* Принимает:   координаты начала чтения (страница/столбец),                                  */
/*              адрес массива для считанных байтов, число считываемых байтов.                 */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Read_Data_from_LCD_4(uint8_t P, uint8_t C, uint8_t *pData, uint8_t n);

/*--------------------------------------------------------------------------------------------*/
/* Процедура записи n байтов данных в столбцы ЖКИ.                                            */
/* Принимает:   координаты начала записи (страница/столбец),                                  */
/*              адрес массива с записываемыми байтами, число записываемых байтов.             */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
void Write_Data_to_LCD_4(uint8_t P, uint8_t C, uint8_t *pData, uint8_t n);


/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда посылки в ЖКИ команды включения (Display_ON).                                 */
/* Принимает:   ничего не принимает.                                                          */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
#define   Write_Cmd_Display_ON()            { Write_Cmd_to_LCD(0, MT12864_CMD_DISPLAY_ON); Write_Cmd_to_LCD(1, MT12864_CMD_DISPLAY_ON); }

/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда посылки в ЖКИ команды выключения (Display_OFF).                               */
/* Принимает:   ничего не принимает.                                                          */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
#define   Write_Cmd_Display_OFF()           { Write_Cmd_to_LCD(0, MT12864_CMD_DISPLAY_OFF); Write_Cmd_to_LCD(1, MT12864_CMD_DISPLAY_OFF); }

#endif