#ifndef __FIXED_WIDTH_FONT_H
#define __FIXED_WIDTH_FONT_H


#include <avr/pgmspace.h>

/*--------------------------------------------------------------------------------------------*/
/* Структура описания шрифта.                                                                 */
/*--------------------------------------------------------------------------------------------*/
struct  FONT
{
  const uint8_t  Height;         // Высота символа в пикселах.
  const uint8_t  Width;          // Ширина символа в пикселах.
  const uint8_t  Count;          // Число символов в шрифте минус один.
  const uint8_t  *pData;  // Адрес таблицы с описанием символов шрифта.
};

#endif