// Source code adopted from electronix.ru
// --------------------------------------

#ifndef __MT12864_CHAR_OUTPUT_H
#define __MT12864_CHAR_OUTPUT_H


#include "util/font/fixed-width-font.h"
#include "cpu/avr/drivers/mt12864/bitblt.h"

/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда вычисления начала размещения описания символа в таблице описания символов.    */
/* Принимает:   код символа,                                                                  */
/*              адрес структуры описания шрифта во flash,                                     */
/* Возвращает:  адрес начала описания символа.                                                */
/*--------------------------------------------------------------------------------------------*/
#define   Get_Char_Data_Addr(ch, font)    \
  (font)->pData + (ch) * (font)->Width * ((((font)->Height % 8) != 0) ? (1 + (font)->Height / 8) : ((font)->Height / 8))

/*--------------------------------------------------------------------------------------------*/
/* Макрокоманда вывода символа заданным шрифтом по заданным координатам.                      */
/* Принимает:   код символа,                                                                  */
/*              координаты вывода символа (графические),                                      */
/*              адрес структуры описания шрифта во flash,                                     */
/*              байт признаков вывода изображения.                                            */
/* Возвращает:  ничего не возвращает.                                                         */
/*--------------------------------------------------------------------------------------------*/
#define   Draw_Char(ch, X, Y, font, flags)    \
  Draw_Bitmap(X, Y, (font)->Width, (font)->Height, Get_Char_Data_Addr(ch, font), flags)

#endif